Measure of central tendency

In [3]:
import numpy as np

#Example 1
E1=[1,1,2,2,3,3,4,5,5,6]

#Example 2
E2=[1,1,2,2,3,3,4,5,5,6,100]

#Example 3
E3=[1,1,2,2,3,3,4,5,5,6,100,200]

#Example 4
E4=[1,2,2,3,4,5,6,6,6,7,8,100,200]

#Example 5
E5=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]

#Example 6
E6=[1,2,2,4]

#Example 7
E7=[2,2,2,2,2]

#Example 8
E8=[2,2,2,2,2,10000]

#using numpy
np.mean(E1)  # using numpy for example 1

3.2

In [4]:
np.mean(E2) # using numpy for example 2

12.0

In [5]:
np.mean(E3) # using numpy for example 3

27.666666666666668

In [6]:
np.mean(E4) # using numpy for example 4

26.923076923076923

In [7]:
np.mean(E5) # using numpy for example 5

382.14285714285717

In [8]:
np.mean(E6) # using numpy for example 6

2.25

In [9]:
np.mean(E7) # using numpy for example 7

2.0

In [10]:
np.mean(E8) # using numpy for example 8

1668.3333333333333

In [11]:
import pandas as pd
z1=pd.DataFrame(data={'values':[1,1,2,2,3,3,4,5,5,6] })# example 1
z1

   values
0       1
1       1
2       2
3       2
4       3
5       3
6       4
7       5
8       5
9       6

In [12]:
import pandas as pd
z2=pd.DataFrame(data={'values':[1,1,2,2,3,3,4,5,5,6,100] }) # example 2
z2

    values
0        1
1        1
2        2
3        2
4        3
5        3
6        4
7        5
8        5
9        6
10     100

In [13]:
import pandas as pd
z3=pd.DataFrame(data={'values':[1,1,2,2,3,3,4,5,5,6,100,200] })# example 3
z3

    values
0        1
1        1
2        2
3        2
4        3
5        3
6        4
7        5
8        5
9        6
10     100
11     200

In [14]:
import pandas as pd
z4=pd.DataFrame(data={'values':[1,2,2,3,4,5,6,6,6,7,8,100,200] })# example 4
z4

    values
0        1
1        2
2        2
3        3
4        4
5        5
6        6
7        6
8        6
9        7
10       8
11     100
12     200

In [15]:
import pandas as pd
z5=pd.DataFrame(data={'values':[1,2,2,3,4,5,6,6,6,7,8,100,200,5000] })# example 5
z5

    values
0        1
1        2
2        2
3        3
4        4
5        5
6        6
7        6
8        6
9        7
10       8
11     100
12     200
13    5000

In [16]:
import pandas as pd
z6=pd.DataFrame(data={'values':[1,2,2,4] })# example 6
z6

   values
0       1
1       2
2       2
3       4

In [17]:
import pandas as pd
z7=pd.DataFrame(data={'values':[2,2,2,2,2] })# example 7
z7

   values
0       2
1       2
2       2
3       2
4       2

In [21]:
import pandas as pd
z8=pd.DataFrame(data={'values':[2,2,2,2,2,10000] })# example 8
z8

   values
0       2
1       2
2       2
3       2
4       2
5   10000

In [24]:
#mean using pandas 
z.mean()

values    1668.333333
dtype: float64

In [25]:
z.describe()

             values
count      6.000000
mean    1668.333333
std     4081.666408
min        2.000000
25%        2.000000
50%        2.000000
75%        2.000000
max    10000.000000

In [26]:
E5=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]

#Using numpy
np.median(E5)

6.0

In [27]:
print("median:",np.median(E5))

median: 6.0

In [28]:
z.describe()

             values
count      6.000000
mean    1668.333333
std     4081.666408
min        2.000000
25%        2.000000
50%        2.000000
75%        2.000000
max    10000.000000

In [29]:
#variance
E5=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]


#using numpy
np.var(E5)

1643272.5510204083

In [30]:
print("Variance : ", np.var(E5))

Variance :  1643272.5510204083

In [31]:
#using pandas
z.var()

values    1.666000e+07
dtype: float64

In [32]:
#standard deviation
E5=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]

#using numpy
np.std(E5)

1281.9019272239232

In [33]:
print("Variance : ", np.std(E5))

Variance :  1281.9019272239232

In [34]:
#using pandas
z.std()

values    4081.666408
dtype: float64

# 5 number Summary
1)Minimum
2)1st quartile -Q1
3)2nd quartile -Q2(Median)
4)3rd quartile -Q3
5)Maximum

In [35]:
#Minimum
E5=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]

#using numpy
np.min(E5)

1

In [36]:
#Maximum
E5=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]

#using numpy
np.max(E5)

5000

In [37]:
print("Minimum : ", np.min(E5))

Minimum :  1

In [38]:
print("Minimum : ", np.max(E5))

Minimum :  5000